Reports/ВедомостьПартииТоваровПереданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>ВедомостьПартииТоваровПереданных</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УниверсальныйОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.УниверсальныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ПартииТоваровПереданные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваровПереданные</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийПартииТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПартий</Name>
					<Comment>Запись сформирована при списании партий</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКорСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвиженияПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиСписанныхТоваров</Name>
					<Comment>Индекс строки списанных товаров</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПередачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПолученияПередачиТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПередачи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереоценкаТоваровОтданныхНаКомиссию</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОприходования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.Партия</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/ВедомостьПартииТоваровПереданных/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройкиУпр(ДополнительныеПараметры = Неопределено)
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	// Описание исходного текста запроса.
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИсточникДанных.Номенклатура КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.Номенклатура),
	|	ИсточникДанных.СтатусПередачи КАК СтатусПередачи,
	|	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.СтатусПередачи),
	|	ИсточникДанных.ДоговорКонтрагента.Владелец КАК ДоговорКонтрагентаВладелец,
	|	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.ДоговорКонтрагента.Владелец),
	|	ИсточникДанных.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.ДоговорКонтрагента),
	|	ИсточникДанных.ДокументПередачи КАК ДокументПередачи,
	|	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.ДокументПередачи),
	|	ИсточникДанных.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.ХарактеристикаНоменклатуры),
	|	ИсточникДанных.ДокументОприходования КАК ДокументОприходования,
	|	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.ДокументОприходования),
	|	ИсточникДанных.СтатусПартии КАК СтатусПартии,
	|	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.СтатусПартии),
	|	ИсточникДанных.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	|	ИсточникДанных.КоличествоНачальныйОстаток * ИсточникДанных.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ИсточникДанных.Номенклатура.ЕдиницаДляОтчетов.Коэффициент КАК КоличествоНачальныйОстатокВЕдиницахДляОтчетов,
	|	ИсточникДанных.КоличествоНачальныйОстаток * ИсточникДанных.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоНачальныйОстатокВБазовыхЕдиницах,
	|	ИсточникДанных.КоличествоПриход КАК КоличествоПриход,
	|	ИсточникДанных.КоличествоПриход * ИсточникДанных.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ИсточникДанных.Номенклатура.ЕдиницаДляОтчетов.Коэффициент КАК КоличествоПриходВЕдиницахДляОтчетов,
	|	ИсточникДанных.КоличествоПриход * ИсточникДанных.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоПриходВБазовыхЕдиницах,
	|	ИсточникДанных.КоличествоРасход КАК КоличествоРасход,
	|	ИсточникДанных.КоличествоРасход * ИсточникДанных.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ИсточникДанных.Номенклатура.ЕдиницаДляОтчетов.Коэффициент КАК КоличествоРасходВЕдиницахДляОтчетов,
	|	ИсточникДанных.КоличествоРасход * ИсточникДанных.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоРасходВБазовыхЕдиницах,
	|	ИсточникДанных.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
	|	ИсточникДанных.КоличествоКонечныйОстаток * ИсточникДанных.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ИсточникДанных.Номенклатура.ЕдиницаДляОтчетов.Коэффициент КАК КоличествоКонечныйОстатокВЕдиницахДляОтчетов,
	|	ИсточникДанных.КоличествоКонечныйОстаток * ИсточникДанных.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоКонечныйОстатокВБазовыхЕдиницах,
	|	ИсточникДанных.СтоимостьНачальныйОстаток КАК СтоимостьНачальныйОстаток,
	|	ИсточникДанных.СтоимостьПриход КАК СтоимостьПриход,
	|	ИсточникДанных.СтоимостьРасход КАК СтоимостьРасход,
	|	ИсточникДанных.СтоимостьКонечныйОстаток КАК СтоимостьКонечныйОстаток,
	|	ИсточникДанных.НДСНачальныйОстаток КАК НДСНачальныйОстаток,
	|	ИсточникДанных.НДСПриход КАК НДСПриход,
	|	ИсточникДанных.НДСРасход КАК НДСРасход,
	|	ИсточникДанных.НДСКонечныйОстаток КАК НДСКонечныйОстаток,
	|	ИсточникДанных.Регистратор КАК Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ИсточникДанных.Регистратор),
	|	ИсточникДанных.Период КАК Период,
	|	НачалоПериода(ИсточникДанных.Период, День) КАК ПериодДень,
	|	НачалоПериода(ИсточникДанных.Период, Неделя) КАК ПериодНеделя,
	|	НачалоПериода(ИсточникДанных.Период, Декада) КАК ПериодДекада,
	|	НачалоПериода(ИсточникДанных.Период, Месяц) КАК ПериодМесяц,
	|	НачалоПериода(ИсточникДанных.Период, Квартал) КАК ПериодКвартал,
	|	НачалоПериода(ИсточникДанных.Период, Полугодие) КАК ПериодПолугодие,
	|	НачалоПериода(ИсточникДанных.Период, Год) КАК ПериодГод
	|	//ПОЛЯ_СВОЙСТВА
	|	//ПОЛЯ_КАТЕГОРИИ
	|{ВЫБРАТЬ
	|	Номенклатура.*,
	|	СтатусПередачи.*,
	|	ДоговорКонтрагентаВладелец.*,
	|	ДоговорКонтрагента.*,
	|	ДокументПередачи.*,
	|	ХарактеристикаНоменклатуры.*,
	|	ДокументОприходования.*,
	|	СтатусПартии.*,
	|	КоличествоНачальныйОстаток,
	|	КоличествоНачальныйОстатокВЕдиницахДляОтчетов,
	|	КоличествоНачальныйОстатокВБазовыхЕдиницах,
	|	КоличествоПриход,
	|	КоличествоПриходВЕдиницахДляОтчетов,
	|	КоличествоПриходВБазовыхЕдиницах,
	|	КоличествоРасход,
	|	КоличествоРасходВЕдиницахДляОтчетов,
	|	КоличествоРасходВБазовыхЕдиницах,
	|	КоличествоКонечныйОстаток,
	|	КоличествоКонечныйОстатокВЕдиницахДляОтчетов,
	|	КоличествоКонечныйОстатокВБазовыхЕдиницах,
	|	СтоимостьНачальныйОстаток,
	|	СтоимостьПриход,
	|	СтоимостьРасход,
	|	СтоимостьКонечныйОстаток,
	|	НДСНачальныйОстаток,
	|	НДСПриход,
	|	НДСРасход,
	|	НДСКонечныйОстаток,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}
	|ИЗ РегистрНакопления.ПартииТоваровПереданные.ОстаткиИОбороты(&ДатаНач, &ДатаКон, Регистратор {&Периодичность},, {
	|	Номенклатура.* КАК Номенклатура,
	|	СтатусПередачи.* КАК СтатусПередачи,
	|	ДоговорКонтрагента.Владелец.* КАК ДоговорКонтрагентаВладелец,
	|	ДоговорКонтрагента.* КАК ДоговорКонтрагента,
	|	ДокументПередачи.* КАК ДокументПередачи,
	|	ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры,
	|	ДокументОприходования.* КАК ДокументОприходования,
	|	СтатусПартии.* КАК СтатусПартии}) КАК ИсточникДанных
	|//СОЕДИНЕНИЯ
	|{ГДЕ
	|	ИсточникДанных.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	|	ИсточникДанных.КоличествоНачальныйОстаток * ИсточникДанных.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ИсточникДанных.Номенклатура.ЕдиницаДляОтчетов.Коэффициент КАК КоличествоНачальныйОстатокВЕдиницахДляОтчетов,
	|	ИсточникДанных.КоличествоНачальныйОстаток * ИсточникДанных.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоНачальныйОстатокВБазовыхЕдиницах,
	|	ИсточникДанных.КоличествоПриход КАК КоличествоПриход,
	|	ИсточникДанных.КоличествоПриход * ИсточникДанных.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ИсточникДанных.Номенклатура.ЕдиницаДляОтчетов.Коэффициент КАК КоличествоПриходВЕдиницахДляОтчетов,
	|	ИсточникДанных.КоличествоПриход * ИсточникДанных.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоПриходВБазовыхЕдиницах,
	|	ИсточникДанных.КоличествоРасход КАК КоличествоРасход,
	|	ИсточникДанных.КоличествоРасход * ИсточникДанных.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ИсточникДанных.Номенклатура.ЕдиницаДляОтчетов.Коэффициент КАК КоличествоРасходВЕдиницахДляОтчетов,
	|	ИсточникДанных.КоличествоРасход * ИсточникДанных.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоРасходВБазовыхЕдиницах,
	|	ИсточникДанных.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
	|	ИсточникДанных.КоличествоКонечныйОстаток * ИсточникДанных.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ИсточникДанных.Номенклатура.ЕдиницаДляОтчетов.Коэффициент КАК КоличествоКонечныйОстатокВЕдиницахДляОтчетов,
	|	ИсточникДанных.КоличествоКонечныйОстаток * ИсточникДанных.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоКонечныйОстатокВБазовыхЕдиницах,
	|	ИсточникДанных.СтоимостьНачальныйОстаток КАК СтоимостьНачальныйОстаток,
	|	ИсточникДанных.СтоимостьПриход КАК СтоимостьПриход,
	|	ИсточникДанных.СтоимостьРасход КАК СтоимостьРасход,
	|	ИсточникДанных.СтоимостьКонечныйОстаток КАК СтоимостьКонечныйОстаток,
	|	ИсточникДанных.НДСНачальныйОстаток,
	|	ИсточникДанных.НДСПриход,
	|	ИсточникДанных.НДСРасход,
	|	ИсточникДанных.НДСКонечныйОстаток,
	|	ИсточникДанных.Регистратор.* КАК Регистратор,
	|	ИсточникДанных.Период КАК Период,
	|	НачалоПериода(ИсточникДанных.Период, День) КАК ПериодДень,
	|	НачалоПериода(ИсточникДанных.Период, Неделя) КАК ПериодНеделя,
	|	НачалоПериода(ИсточникДанных.Период, Декада) КАК ПериодДекада,
	|	НачалоПериода(ИсточникДанных.Период, Месяц) КАК ПериодМесяц,
	|	НачалоПериода(ИсточникДанных.Период, Квартал) КАК ПериодКвартал,
	|	НачалоПериода(ИсточникДанных.Период, Полугодие) КАК ПериодПолугодие,
	|	НачалоПериода(ИсточникДанных.Период, Год) КАК ПериодГод
	|	//УСЛОВИЯ_СВОЙСТВА
	|	//УСЛОВИЯ_КАТЕГОРИИ
	|}
	|{УПОРЯДОЧИТЬ ПО
	|	Номенклатура.*,
	|	СтатусПередачи.*,
	|	ДоговорКонтрагентаВладелец.*,
	|	ДоговорКонтрагента.*,
	|	ДокументПередачи.*,
	|	ХарактеристикаНоменклатуры.*,
	|	ДокументОприходования.*,
	|	СтатусПартии.*,
	|	КоличествоНачальныйОстаток,
	|	КоличествоНачальныйОстатокВЕдиницахДляОтчетов,
	|	КоличествоНачальныйОстатокВБазовыхЕдиницах,
	|	КоличествоПриход,
	|	КоличествоПриходВЕдиницахДляОтчетов,
	|	КоличествоПриходВБазовыхЕдиницах,
	|	КоличествоРасход,
	|	КоличествоРасходВЕдиницахДляОтчетов,
	|	КоличествоРасходВБазовыхЕдиницах,
	|	КоличествоКонечныйОстаток,
	|	КоличествоКонечныйОстатокВЕдиницахДляОтчетов,
	|	КоличествоКонечныйОстатокВБазовыхЕдиницах,
	|	СтоимостьНачальныйОстаток,
	|	СтоимостьПриход,
	|	СтоимостьРасход,
	|	СтоимостьКонечныйОстаток,
	|	НДСНачальныйОстаток,
	|	НДСКонечныйОстаток,
	|	НДСПриход,
	|	НДСРасход,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}
	|ИТОГИ
	|	СУММА(КоличествоНачальныйОстаток),
	|	СУММА(КоличествоНачальныйОстатокВЕдиницахДляОтчетов),
	|	СУММА(КоличествоНачальныйОстатокВБазовыхЕдиницах),
	|	СУММА(КоличествоПриход),
	|	СУММА(КоличествоПриходВЕдиницахДляОтчетов),
	|	СУММА(КоличествоПриходВБазовыхЕдиницах),
	|	СУММА(КоличествоРасход),
	|	СУММА(КоличествоРасходВЕдиницахДляОтчетов),
	|	СУММА(КоличествоРасходВБазовыхЕдиницах),
	|	СУММА(КоличествоКонечныйОстаток),
	|	СУММА(КоличествоКонечныйОстатокВЕдиницахДляОтчетов),
	|	СУММА(КоличествоКонечныйОстатокВБазовыхЕдиницах),
	|	СУММА(СтоимостьНачальныйОстаток),
	|	СУММА(СтоимостьПриход),
	|	СУММА(СтоимостьРасход),
	|	СУММА(СтоимостьКонечныйОстаток),
	|	СУММА(НДСНачальныйОстаток),
	|	СУММА(НДСПриход),
	|	СУММА(НДСРасход),
	|	СУММА(НДСКонечныйОстаток)
	|	//ИТОГИ_СВОЙСТВА
	|	//ИТОГИ_КАТЕГОРИИ
	|ПО
	|	ОБЩИЕ
	|{ИТОГИ ПО
	|	Номенклатура.*,
	|	СтатусПередачи.*,
	|	ДоговорКонтрагентаВладелец.*,
	|	ДоговорКонтрагента.*,
	|	ДокументПередачи.*,
	|	ХарактеристикаНоменклатуры.*,
	|	ДокументОприходования.*,
	|	СтатусПартии.*,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}";
	
	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		
		// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ИсточникДанных.Номенклатура", "Номенклатура", "Номенклатура", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ИсточникДанных.ХарактеристикаНоменклатуры", "ХарактеристикаНоменклатуры", НСтр("ru='Характеристика номенклатуры';uk='Характеристика номенклатури'"), ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ХарактеристикиНоменклатуры);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ИсточникДанных.ДоговорКонтрагента.Владелец", "ДоговорКонтрагентаВладелец", "Контрагент", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ИсточникДанных.ДоговорКонтрагента", "ДоговорКонтрагента", НСтр("ru='Договор контрагента';uk='Договір контрагента'"), ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ДоговорыКонтрагентов);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ИсточникДанных.ДокументПередачи", "ДокументПередачи", НСтр("ru='Документ передачи';uk='Документ передачі'"), ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документы);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ИсточникДанных.ДокументОприходования", "ДокументОприходования", НСтр("ru='Документ оприходования';uk='Документ оприбуткування'"), ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документы);
		
		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
		
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДокументОприходования", НСтр("ru='Документ оприходования';uk='Документ оприбуткування'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ХарактеристикаНоменклатуры", НСтр("ru='Характеристика номенклатуры';uk='Характеристика номенклатури'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СерияНоменклатуры", НСтр("ru='Серия номенклатуры';uk='Серія номенклатури'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтатусПартии", НСтр("ru='Статус партии';uk='Статус партії'"));
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтатусПередачи", НСтр("ru='Статус передачи';uk='Статус передачі'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДоговорКонтрагентаВладелец", "Контрагент");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДоговорКонтрагента", НСтр("ru='Договор контрагента';uk='Договір контрагента'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДокументПередачи", НСтр("ru='Документ передачи';uk='Документ передачі'"));
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоНачальныйОстаток", НСтр("ru='Количество начальный остаток';uk='Кількість початковий залишок'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоНачальныйОстатокВЕдиницахДляОтчетов", НСтр("ru='Количество начальный остаток (в ед. отчетов)';uk='Кількість початковий залишок (в од. звітів)'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоНачальныйОстатокВБазовыхЕдиницах", НСтр("ru='Количество начальный остаток (в базовых ед.)';uk='Кількість початковий залишок (у базових од.)'"));
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьНачальныйОстаток", НСтр("ru='Стоимость начальный остаток';uk='Вартість початковий залишок'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НДСНачальныйОстаток", НСтр("ru='НДС  начальный остаток';uk='ПДВ початковий залишок'"));
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоПриход", НСтр("ru='Количество приход';uk='Кількість прибуток'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоПриходВЕдиницахДляОтчетов", НСтр("ru='Количество приход (в ед. отчетов)';uk='Кількість прибуток (в од. звітів)'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоПриходВБазовыхЕдиницах", НСтр("ru='Количество приход (в базовых ед.)';uk='Кількість прибуток (у базових од.)'"));
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьПриход", НСтр("ru='Стоимость приход';uk='Вартість прибуток'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НДСПриход", НСтр("ru='НДС приход';uk='ПДВ прибуток'"));
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоРасход", НСтр("ru='Количество расход';uk='Кількість витрата'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоРасходВЕдиницахДляОтчетов", НСтр("ru='Количество расход (в ед. отчетов)';uk='Кількість витрата (в од. звітів)'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоРасходВБазовыхЕдиницах", НСтр("ru='Количество расход (в базовых ед.)';uk='Кількість витрата (в базових од.)'"));
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьРасход", НСтр("ru='Стоимость расход';uk='Вартість витрата'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НДСРасход", НСтр("ru='НДС расход';uk='ПДВ витрата'"));
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоКонечныйОстаток", НСтр("ru='Количество конечный остаток';uk='Кількість кінцевий залишок'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоКонечныйОстатокВЕдиницахДляОтчетов", НСтр("ru='Количество конечный остаток (в ед. отчетов)';uk='Кількість кінцевий залишок (в од. звітів)'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоКонечныйОстатокВБазовыхЕдиницах", НСтр("ru='Количество конечный остаток (в базовых ед.)';uk='Кількість кінцевий залишок (у базових од.)'"));
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьКонечныйОстаток", НСтр("ru='Стоимость конечный остаток';uk='Вартість кінцевий залишок'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НДСКонечныйОстаток", НСтр("ru='НДС конечный остаток';uk='ПДВ кінцевий залишок'"));
	
	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоНачальныйОстаток", "Количество", Истина, "ЧЦ=15; ЧДЦ=3", "НачальныйОстаток", НСтр("ru='Начальный остаток';uk='Початковий залишок'"));
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоНачальныйОстатокВЕдиницахДляОтчетов", НСтр("ru='Количество (в ед. отчетов)';uk='Кількість (в од. звітів)'"), Ложь, "ЧЦ=15; ЧДЦ=3", "НачальныйОстаток", НСтр("ru='Начальный остаток';uk='Початковий залишок'"));
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоНачальныйОстатокВБазовыхЕдиницах", НСтр("ru='Количество (в базовых ед.)';uk='Кількість (у базових од.)'"), Ложь, "ЧЦ=15; ЧДЦ=3", "НачальныйОстаток", НСтр("ru='Начальный остаток';uk='Початковий залишок'"));
	УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьНачальныйОстаток", "Стоимость", Истина, "ЧЦ=15; ЧДЦ=2", "НачальныйОстаток", НСтр("ru='Начальный остаток';uk='Початковий залишок'"));
	УниверсальныйОтчет.ДобавитьПоказатель("НДСНачальныйОстаток", "НДС", Истина, "ЧЦ=15; ЧДЦ=2", "НачальныйОстаток", НСтр("ru='Начальный остаток';uk='Початковий залишок'"));
	
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоПриход", "Количество", Истина, "ЧЦ=15; ЧДЦ=3", "Приход", "Приход");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоПриходВЕдиницахДляОтчетов", НСтр("ru='Количество (в ед. отчетов)';uk='Кількість (в од. звітів)'"), Ложь, "ЧЦ=15; ЧДЦ=3", "Приход", "Приход");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоПриходВБазовыхЕдиницах", НСтр("ru='Количество (в базовых ед.)';uk='Кількість (у базових од.)'"), Ложь, "ЧЦ=15; ЧДЦ=3", "Приход", "Приход");
	УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьПриход", "Стоимость", Истина, "ЧЦ=15; ЧДЦ=2", "Приход", "Приход");
	УниверсальныйОтчет.ДобавитьПоказатель("НДСПриход", "НДС", Истина, "ЧЦ=15; ЧДЦ=2", "Приход", "Приход");
	
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоРасход", "Количество", Истина, "ЧЦ=15; ЧДЦ=3", "Расход", "Расход");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоРасходВЕдиницахДляОтчетов", НСтр("ru='Количество (в ед. отчетов)';uk='Кількість (в од. звітів)'"), Ложь, "ЧЦ=15; ЧДЦ=3", "Расход", "Расход");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоРасходВБазовыхЕдиницах", НСтр("ru='Количество (в базовых ед.)';uk='Кількість (у базових од.)'"), Ложь, "ЧЦ=15; ЧДЦ=3", "Расход", "Расход");
	УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьРасход", "Стоимость", Истина, "ЧЦ=15; ЧДЦ=2", "Расход", "Расход");
	УниверсальныйОтчет.ДобавитьПоказатель("НДСРасход", "НДС", Истина, "ЧЦ=15; ЧДЦ=2", "Расход", "Расход");
	
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоКонечныйОстаток", "Количество", Истина, "ЧЦ=15; ЧДЦ=3", "КонечныйОстаток", НСтр("ru='Конечный остаток';uk='Кінцевий залишок'"));
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоКонечныйОстатокВЕдиницахДляОтчетов", НСтр("ru='Количество (в ед. отчетов)';uk='Кількість (в од. звітів)'"), Ложь, "ЧЦ=15; ЧДЦ=3", "КонечныйОстаток", НСтр("ru='Конечный остаток';uk='Кінцевий залишок'"));
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоКонечныйОстатокВБазовыхЕдиницах", НСтр("ru='Количество (в базовых ед.)';uk='Кількість (у базових од.)'"), Ложь, "ЧЦ=15; ЧДЦ=3", "КонечныйОстаток", НСтр("ru='Конечный остаток';uk='Кінцевий залишок'"));
	УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьКонечныйОстаток", "Стоимость", Истина, "ЧЦ=15; ЧДЦ=2", "КонечныйОстаток", НСтр("ru='Конечный остаток';uk='Кінцевий залишок'"));
	УниверсальныйОтчет.ДобавитьПоказатель("НДСКонечныйОстаток", "НДС", Истина, "ЧЦ=15; ЧДЦ=2", "КонечныйОстаток", НСтр("ru='Конечный остаток';uk='Кінцевий залишок'"));
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ДокументОприходования");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Номенклатура");
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	
	УниверсальныйОтчет.ДобавитьОтбор("Номенклатура");
	УниверсальныйОтчет.ДобавитьОтбор("ДокументОприходования");
		
	// Добавление предопределенных полей порядка отчета.
	// Необходимо вызывать для каждого добавляемого поля порядка.
	// УниверсальныйОтчет.ДобавитьПорядок(<ПутьКДанным>);
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДанным>);
	
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>);
	
КонецПроцедуры // УстановитьНачальныеНастройкиУпр()

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, ДополнительныеПараметры);
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.ИмяРегистра = "ТоварыНаСкладах";
	
	// Содержит значение используемого режима ввода периода.
	// Тип: Число.
	// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
	// Значение по умолчанию: 0
	// Пример:
	// УниверсальныйОтчет.мРежимВводаПериода = 0;
	
	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	//УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;

	УстановитьНачальныеНастройкиУпр(ДополнительныеПараметры);
	
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);

КонецПроцедуры // СформироватьОтчет()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект);
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
// УниверсальныйОтчет.мРежимВводаПериода = 1;

#КонецЕсли
